src/cf/src/Documents/ПередачаВПереработку/ПередачаВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВПереработку</name>
  <basedOn>Document.ВыпускПродукции</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВПереработке</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <comment>Полуфабрикат или готовая продукция заказа, для которой передаётся материал (2.0.16.16); пусто - по правилу заказа</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <comment>Сколько ПФ/ГП ожидается из материала строки, в базовых единицах ПФ/ГП (2.0.16.17); 0 - по правилу заказа</comment>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/ПередачаВПереработку/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "АктПередачи";
	Команда.Представление = НСтр("ru = 'Акт передачи в переработку'; fr = 'Bon de transfert en sous-traitance';
		|en = 'Transfer for processing act'; es = 'Acta de transferencia a procesamiento'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПередачи") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьАктПередачи(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "АктПередачи",
			НСтр("ru = 'Акт передачи в переработку'; fr = 'Bon de transfert en sous-traitance';
			|en = 'Transfer for processing act'; es = 'Acta de transferencia a procesamiento'"),
			Таб, "Документ.ПередачаВПереработку.АктПередачи");
	КонецЕсли;

КонецПроцедуры

// Печать акта по документу в табличный документ (с разделителем страниц после каждого документа).
//
// Параметры:
//  Док - ДокументСсылка.ПередачаВПереработку - печатаемый документ
//  Таб - ТабличныйДокумент - документ, в который выводится акт
//
Процедура ПечатьАктПередачи(Док, Таб) Экспорт
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПередачаВПереработку_АктПередачи";
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док,
		"Организация,МестоХранения,Контрагент,Ответственный");
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ПередачаВПереработку.АктПередачи");
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТекстЗаголовка = НСтр("ru = 'Акт передачи в переработку'; fr = 'Bon de transfert en sous-traitance';
		|en = 'Transfer for processing act'; es = 'Acta de transferencia a procesamiento'");
	Область.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, ТекстЗаголовка);
	Таб.Вывести(Область);
	Область = Макет.ПолучитьОбласть("РеквизитыОрганизации");
	Область.Параметры.ПредставлениеОрганизации = Реквизиты.Организация;
	Область.Параметры.ПредставлениеСклада = Реквизиты.МестоХранения;
	Область.Параметры.ПредставлениеКонтрагента = Реквизиты.Контрагент;
	Таб.Вывести(Область);
	Подзаголовок = НСтр("ru = 'Передано сырьё и полуфабрикаты'; fr = 'Matières premières et semi-finis transférés';
		|en = 'Raw materials and semi-finished products transferred'; es = 'Materias primas y semielaborados transferidos'");
	ВывестиТаблицу(Таб, Макет, ТаблицаСырья(Док), Подзаголовок, Истина);
	Подзаголовок = НСтр("ru = 'Ожидаемая продукция'; fr = 'Produits attendus'; en = 'Expected products'; es = 'Productos esperados'");
	ВывестиТаблицу(Таб, Макет, ТаблицаПродукции(Док), Подзаголовок, Ложь);
	Область = Макет.ПолучитьОбласть("Подписи");
	Область.Параметры.ОтветственныйПредставление = Реквизиты.Ответственный;
	Таб.Вывести(Область);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	ИмяФайла = НСтр("ru = 'Акт передачи'; fr = 'Bon de transfert'; en = 'Transfer act'; es = 'Acta de transferencia'");
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, ИмяФайла);
КонецПроцедуры

// Ожидаемая продукция передачи по заказу-основанию - одно правило на проведение, форму и команду.
// Пустая ожидаемая продукция и «поведение до S5» - разные случаи:
//  - у заказа нет дерева материалов (плоский заказ) - строки товаров заказа, как было всегда;
//  - дерево есть, переданное в нём нашлось - родители переданных строк;
//  - дерево есть, переданное не нашлось (передача готовой продукции переработчику) - строки товаров;
//  - дерево есть, но не передано ещё ничего - ПУСТО, а не весь заказ: иначе удаление последней строки
//    товаров молча подставляло бы полное количество заказа, и оно уезжало бы в поступление.
//
// Параметры:
//  Заказ    - ДокументСсылка.ЗаказПокупателя - заказ-основание передачи.
//  ТЗТовары - ТаблицаЗначений - передаваемые строки, колонки Номенклатура, Характеристика, Количество.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки ТЧГотоваяПродукция передачи.
//
Функция ОжидаемаяПродукцияПередачи(Заказ, ТЗТовары) Экспорт
	ПоДереву = ПродукцияПоДеревуЗаказа(Заказ, ТЗТовары);
	Если ПоДереву.НашлосьПереданное Тогда
		Возврат ПоДереву.Строки;
	КонецЕсли;
	Если Не ПоДереву.ДеревоЕсть Или ЕстьПереданное(ТЗТовары) Тогда
		Возврат ПродукцияПоТоварамЗаказа(Заказ);
	КонецЕсли;
	Возврат ПоДереву.Строки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Есть ли в передаче хоть одна строка с положительным количеством.
//
// Параметры:
//  ТЗТовары - ТаблицаЗначений - строки товаров передачи.
//
// Возвращаемое значение:
//  Булево - есть.
//
Функция ЕстьПереданное(ТЗТовары)
	Для Каждого Стр Из ТЗТовары Цикл
		Если ЗначениеЗаполнено(Стр.Номенклатура) И Стр.Количество > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// Ожидаемая продукция по дереву материалов заказа: РОДИТЕЛИ переданных строк дерева.
// Передали листья - ждём их узел; передали узел - ждём его родителя; родитель оказался строкой товаров -
// ждём её, как было до S5. Количество родителя - доля переданного («переданное / нужное ему по заказу»,
// наименьшая среди переданных материалов, не больше единицы), потолок - заказанное.
// Родитель, а не сам узел: карта принимаемой продукции обязана состоять из того, что лежит у переработчика,
// а карта узла состоит из его листьев - «ждём тот же узел» обнулило бы расчёт расхода сырья.
// Функция живёт в модуле менеджера, а не объекта: её зовут и проведение, и форма передачи на каждое изменение
// строки товаров, и передавать туда весь документ ради двух колонок незачем.
//
// Параметры:
//  Заказ    - ДокументСсылка.ЗаказПокупателя - заказ-основание передачи.
//  ТЗТовары - ТаблицаЗначений - передаваемые строки, колонки Номенклатура, Характеристика, Количество.
//
// Возвращаемое значение:
//  Структура:
//   * Строки            - ТаблицаЗначений - колонки ТЧГотоваяПродукция передачи, в порядке строк заказа;
//   * ДеревоЕсть        - Булево - у заказа есть строки материалов;
//   * НашлосьПереданное - Булево - хотя бы одна переданная позиция нашлась в дереве заказа.
//
Функция ПродукцияПоДеревуЗаказа(Заказ, ТЗТовары)
	Результат = Новый Структура("Строки, ДеревоЕсть, НашлосьПереданное",
		НоваяТаблицаОжидаемойПродукции(), Ложь, Ложь);
	Пакет = СтрокиЗаказа(Заказ);
	Товары = Пакет[0].Выгрузить();
	Материалы = Пакет[1].Выгрузить();
	Результат.ДеревоЕсть = Материалы.Количество() > 0;
	Переданное = ПереданноеПоПозициям(ТЗТовары);
	Если Не Результат.ДеревоЕсть Или Переданное.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	СтрокиРодителей = СтрокиРодителейЗаказа(Товары, Материалы);
	Потребность = ПотребностьРодителей(Материалы);
	Для Каждого КлючРодителя Из Потребность.Ключи Цикл
		Родитель = СтрокиРодителей[КлючРодителя];
		Если Родитель = Неопределено Тогда
			// Строка материалов ссылается на родителя из-под другой строки продукции или на снятый код.
			Продолжить;
		КонецЕсли;
		Доля = ДоляПереданного(Потребность.Позиции[КлючРодителя], Переданное);
		Если Доля <= 0 Тогда
			Продолжить;
		КонецЕсли;
		Результат.НашлосьПереданное = Истина;
		ДобавитьОжидаемуюПродукцию(Результат.Строки, Родитель, Доля);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Строки заказа по ключу родителя: строка товаров - под ключом «свой код + 0», строка материалов - под
// «код строки продукции + свой код».
//
// Параметры:
//  Товары    - ТаблицаЗначений - строки товаров заказа.
//  Материалы - ТаблицаЗначений - строки материалов заказа.
//
// Возвращаемое значение:
//  Соответствие - ключ Строка (см. Документы.ЗаказПокупателя.КлючРодителяМатериала), значение строка таблицы.
//
Функция СтрокиРодителейЗаказа(Товары, Материалы)
	Результат = Новый Соответствие;
	Для Каждого Товар Из Товары Цикл
		Ключ = Документы.ЗаказПокупателя.КлючРодителяМатериала(Товар.КодСтроки, 0);
		Результат.Вставить(Ключ, Товар);
	КонецЦикла;
	Для Каждого Материал Из Материалы Цикл
		Если Материал.КодСтроки = 0 Тогда
			// Строка без кода никому не родитель: иначе она встала бы на место строки товаров с тем же нулём
			// в ключе и увела ожидаемую продукцию в номенклатуру материала.
			Продолжить;
		КонецЕсли;
		Ключ = Документы.ЗаказПокупателя.КлючРодителяМатериала(Материал.КодСтрокиПродукции, Материал.КодСтроки);
		Результат.Вставить(Ключ, Материал);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Потребность каждого родителя по позициям его материалов, в порядке строк заказа.
//
// Параметры:
//  Материалы - ТаблицаЗначений - строки материалов заказа.
//
// Возвращаемое значение:
//  Структура:
//   * Ключи   - Массив из Строка - ключи родителей в порядке первого появления;
//   * Позиции - Соответствие - ключ родителя, значение Соответствие «ключ позиции - количество».
//
Функция ПотребностьРодителей(Материалы)
	Результат = Новый Структура("Ключи, Позиции", Новый Массив, Новый Соответствие);
	Для Каждого Материал Из Материалы Цикл
		Если Не ЗначениеЗаполнено(Материал.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		КлючРодителя = Документы.ЗаказПокупателя.КлючРодителяМатериала(
			Материал.КодСтрокиПродукции, Материал.КодСтрокиРодителя);
		Позиции = Результат.Позиции[КлючРодителя];
		Если Позиции = Неопределено Тогда
			Позиции = Новый Соответствие;
			Результат.Позиции.Вставить(КлючРодителя, Позиции);
			Результат.Ключи.Добавить(КлючРодителя);
		КонецЕсли;
		Ключ = КлючПозиции(Материал.Номенклатура, Материал.Характеристика);
		Накоплено = ?(Позиции[Ключ] = Неопределено, 0, Позиции[Ключ]);
		Позиции.Вставить(Ключ, Накоплено + Материал.Количество);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Строки товаров заказа с продукцией и полуфабрикатами - поведение до S5 и запасной путь нового правила.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ-основание передачи.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки ТЧГотоваяПродукция передачи.
//
Функция ПродукцияПоТоварамЗаказа(Заказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.Упаковка КАК Упаковка,
	                      |	ТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ТЧТовары.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.ЗаказПокупателя.ТЧТовары КАК ТЧТовары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ПО ТЧТовары.Номенклатура = СправочникНоменклатура.Ссылка
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Заказ
	                      |	И СправочникНоменклатура.ТипНоменклатуры В (&ТипыПродукции)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТЧТовары.НомерСтроки");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	ТипыПродукции = Новый Массив;
	ТипыПродукции.Добавить(Перечисления.ТипыНоменклатуры.Продукция);
	ТипыПродукции.Добавить(Перечисления.ТипыНоменклатуры.Полуфабрикат);
	Запрос.УстановитьПараметр("ТипыПродукции", ТипыПродукции);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Пустая таблица с типами колонок табличной части продукции: количество округлится её разрядностью.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Упаковка, КоличествоУпаковок, Количество.
//
Функция НоваяТаблицаОжидаемойПродукции()
	Реквизиты = Метаданные.Документы.ПередачаВПереработку.ТабличныеЧасти.ТЧГотоваяПродукция.Реквизиты;
	Таблица = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из СтрРазделить("Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Количество", ",") Цикл
		Таблица.Колонки.Добавить(ИмяКолонки, Реквизиты[ИмяКолонки].Тип);
	КонецЦикла;
	Возврат Таблица;
КонецФункции

// Переданное переработчику по позициям, в базовом количестве; нулевые строки в расчёт не идут.
//
// Параметры:
//  ТЗТовары - ТаблицаЗначений - передаваемые строки.
//
// Возвращаемое значение:
//  Соответствие - ключ Строка (см. КлючПозиции), значение Число.
//
Функция ПереданноеПоПозициям(ТЗТовары)
	Результат = Новый Соответствие;
	Для Каждого Стр Из ТЗТовары Цикл
		Если Не ЗначениеЗаполнено(Стр.Номенклатура) Или Стр.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		Ключ = КлючПозиции(Стр.Номенклатура, Стр.Характеристика);
		Результат.Вставить(Ключ, ?(Результат[Ключ] = Неопределено, 0, Результат[Ключ]) + Стр.Количество);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Строки товаров и материалов заказа одним пакетом.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ-основание передачи.
//
// Возвращаемое значение:
//  Массив из РезультатЗапроса - первый результат товары, второй материалы.
//
Функция СтрокиЗаказа(Заказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЧТовары.КодСтроки КАК КодСтроки,
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.Упаковка КАК Упаковка,
	                      |	ТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ТЧТовары.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.ЗаказПокупателя.ТЧТовары КАК ТЧТовары
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Заказ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТЧТовары.НомерСтроки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧМатериалы.КодСтроки КАК КодСтроки,
	                      |	ТЧМатериалы.КодСтрокиПродукции КАК КодСтрокиПродукции,
	                      |	ТЧМатериалы.КодСтрокиРодителя КАК КодСтрокиРодителя,
	                      |	ТЧМатериалы.Номенклатура КАК Номенклатура,
	                      |	ТЧМатериалы.Характеристика КАК Характеристика,
	                      |	ТЧМатериалы.Упаковка КАК Упаковка,
	                      |	ТЧМатериалы.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ТЧМатериалы.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.ЗаказПокупателя.ТЧМатериалы КАК ТЧМатериалы
	                      |ГДЕ
	                      |	ТЧМатериалы.Ссылка = &Заказ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТЧМатериалы.НомерСтроки");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Возврат Запрос.ВыполнитьПакет();
КонецФункции

// Наименьшая доля переданного среди материалов родителя; материалы, которых в передаче нет, долю не
// ограничивают - переработчик может делать из своего.
//
// Параметры:
//  Позиции    - Соответствие - ключ позиции материала, значение потребность родителя по заказу.
//  Переданное - Соответствие - см. ПереданноеПоПозициям.
//
// Возвращаемое значение:
//  Число - от 0 до 1; ноль означает «ни один материал родителя не передаётся».
//
Функция ДоляПереданного(Позиции, Переданное)
	// Неопределено, а не ноль: ноль - законная доля, и сравнение с нулём позволило бы следующему
	// материалу её перебить.
	Результат = Неопределено;
	Для Каждого КлючИЗначение Из Позиции Цикл
		Передано = Переданное[КлючИЗначение.Ключ];
		Если Передано = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Доля = ?(КлючИЗначение.Значение <= 0, 1, Мин(1, Передано / КлючИЗначение.Значение));
		Результат = ?(Результат = Неопределено, Доля, Мин(Результат, Доля));
	КонецЦикла;
	Возврат ?(Результат = Неопределено, 0, Результат);
КонецФункции

// Добавляет строку ожидаемой продукции по строке-родителю, сводя повторы одной позиции.
//
// Параметры:
//  Строки   - ТаблицаЗначений - см. НоваяТаблицаОжидаемойПродукции; пополняется.
//  Родитель - СтрокаТаблицыЗначений - строка товаров или материалов заказа.
//  Доля     - Число - доля переданного.
//
Процедура ДобавитьОжидаемуюПродукцию(Строки, Родитель, Доля)
	Отбор = Новый Структура("Номенклатура, Характеристика, Упаковка",
		Родитель.Номенклатура, Родитель.Характеристика, Родитель.Упаковка);
	Найденные = Строки.НайтиСтроки(Отбор);
	Строка = ?(Найденные.Количество() > 0, Найденные[0], Строки.Добавить());
	ЗаполнитьЗначенияСвойств(Строка, Отбор);
	Строка.Количество = Строка.Количество + Родитель.Количество * Доля;
	Строка.КоличествоУпаковок = Строка.КоличествоУпаковок + Родитель.КоличествоУпаковок * Доля;
КонецПроцедуры

// Ключ позиции «номенклатура + характеристика» для соответствий.
//
// Параметры:
//  Номенклатура   - СправочникСсылка.Номенклатура - позиция.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика позиции.
//
// Возвращаемое значение:
//  Строка - ключ.
//
Функция КлючПозиции(Номенклатура, Характеристика)
	Возврат XMLСтрока(Номенклатура) + "|" + XMLСтрока(Характеристика);
КонецФункции

Процедура ВывестиТаблицу(Таб, Макет, ТЗ, Подзаголовок, СИтогами)
	// Таблица строк с шапкой; при СИтогами - итог и сумма прописью по себестоимости из движений.
	Область = Макет.ПолучитьОбласть("Подзаголовок");
	Область.Параметры.Подзаголовок = Подзаголовок;
	Таб.Вывести(Область);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	Область = Макет.ПолучитьОбласть("Строка");
	Для Каждого Стр Из ТЗ Цикл
		Область.Параметры.Заполнить(Стр);
		Область.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура,
			Стр.Характеристика, , Истина);
		Если СИтогами Тогда
			Область.Параметры.Цена = ?(Стр.Количество = 0, 0, Окр(Стр.Сумма / Стр.Количество, РазрядностьСуммы()));
		Иначе
			Область.Параметры.Цена = "";
			Область.Параметры.Сумма = "";
		КонецЕсли;
		Таб.Вывести(Область);
	КонецЦикла;
	Если Не СИтогами Тогда
		Возврат;
	КонецЕсли;
	Сумма = ТЗ.Итог("Сумма");
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.Всего = Сумма;
	Таб.Вывести(Область);
	Область = Макет.ПолучитьОбласть("СуммаПрописью");
	Область.Параметры.СуммаПрописью = ПечатныеФормы.СуммаПрописьюВВалютеУчета(Сумма);
	Таб.Вывести(Область);
КонецПроцедуры

Функция РазрядностьСуммы()
	Возврат 2;
КонецФункции

Функция ТаблицаСырья(Док)
	// Сырьё с себестоимостью списания со склада.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Движения.Номенклатура КАК Номенклатура,
	                      |	Движения.Характеристика КАК Характеристика,
	                      |	СУММА(Движения.Количество) КАК Количество,
	                      |	СУММА(Движения.Сумма) КАК Сумма
	                      |ПОМЕСТИТЬ ВТДвижения
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии КАК Движения
	                      |ГДЕ
	                      |	Движения.Регистратор = &Док
	                      |	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Движения.Номенклатура,
	                      |	Движения.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.НомерСтроки КАК НомерСтроки,
	                      |	СправочникНоменклатура.Артикул КАК Артикул,
	                      |	ТЧ.Номенклатура КАК Номенклатура,
	                      |	ТЧ.Характеристика КАК Характеристика,
	                      |	ТЧ.КоличествоУпаковок КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ТЧ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА СправочникНоменклатура.Единица
	                      |		ИНАЧЕ ТЧ.Упаковка
	                      |	КОНЕЦ КАК ЕдиницаИзмерения,
	                      |	ТЧ.Количество КАК Количество,
	                      |	СправочникНоменклатура.Единица КАК ЕдиницаХранения,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(ВТДвижения.Количество, 0) = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТДвижения.Сумма, 0) / ВТДвижения.Количество * ТЧ.Количество КАК ЧИСЛО(15, 2))
	                      |	КОНЕЦ КАК Сумма
	                      |ИЗ
	                      |	Документ.ПередачаВПереработку.ТЧТовары КАК ТЧ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ПО ТЧ.Номенклатура = СправочникНоменклатура.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвижения КАК ВТДвижения
	                      |		ПО ТЧ.Номенклатура = ВТДвижения.Номенклатура
	                      |			И ТЧ.Характеристика = ВТДвижения.Характеристика
	                      |ГДЕ
	                      |	ТЧ.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("Док", Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ТаблицаПродукции(Док)
	// Ожидаемая продукция; движений по ней нет, суммы нулевые.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Движения.Номенклатура КАК Номенклатура,
	                      |	Движения.Характеристика КАК Характеристика,
	                      |	СУММА(Движения.Количество) КАК Количество,
	                      |	СУММА(Движения.Сумма) КАК Сумма
	                      |ПОМЕСТИТЬ ВТДвижения
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии КАК Движения
	                      |ГДЕ
	                      |	Движения.Регистратор = &Док
	                      |	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Движения.Номенклатура,
	                      |	Движения.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.НомерСтроки КАК НомерСтроки,
	                      |	СправочникНоменклатура.Артикул КАК Артикул,
	                      |	ТЧ.Номенклатура КАК Номенклатура,
	                      |	ТЧ.Характеристика КАК Характеристика,
	                      |	ТЧ.КоличествоУпаковок КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ТЧ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА СправочникНоменклатура.Единица
	                      |		ИНАЧЕ ТЧ.Упаковка
	                      |	КОНЕЦ КАК ЕдиницаИзмерения,
	                      |	ТЧ.Количество КАК Количество,
	                      |	СправочникНоменклатура.Единица КАК ЕдиницаХранения,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(ВТДвижения.Количество, 0) = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТДвижения.Сумма, 0) / ВТДвижения.Количество * ТЧ.Количество КАК ЧИСЛО(15, 2))
	                      |	КОНЕЦ КАК Сумма
	                      |ИЗ
	                      |	Документ.ПередачаВПереработку.ТЧГотоваяПродукция КАК ТЧ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ПО ТЧ.Номенклатура = СправочникНоменклатура.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвижения КАК ВТДвижения
	                      |		ПО ТЧ.Номенклатура = ВТДвижения.Номенклатура
	                      |			И ТЧ.Характеристика = ВТДвижения.Характеристика
	                      |ГДЕ
	                      |	ТЧ.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("Док", Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти
